#Pandas

In [251]:
import numpy as np
import pandas as pd

In [252]:
dictionary= {"name":['shristi','ankita','binita','prerana'],
        "age":['12','15','20','25'],
        "city":['Newyork','Berlin','Sydney','Ottawa']}

In [253]:
df=pd.DataFrame(dictionary)

In [254]:
df

      name age     city
0  shristi  12  Newyork
1   ankita  15   Berlin
2   binita  20   Sydney
3  prerana  25   Ottawa

Here 0,1,2,3 is index. name age city is column. the dictionary is in DataFrame.
DataFrame:multi dimentional(can have multiple rows and column)
Series:single dimentional(single row single column)

In [255]:
df.to_csv('exelsheet.csv')

if i dont want to print index, then

In [256]:
df.to_csv('excelsheet.csv',index=False)

In [257]:
df.head(2)  # just printing 2 head from manny data

      name age     city
0  shristi  12  Newyork
1   ankita  15   Berlin

In [258]:
df.tail(2) ## just printing 2 tail from manny data

      name age    city
2   binita  20  Sydney
3  prerana  25  Ottawa

In [259]:
df.describe() #statistical analysis

           name age     city
count         4   4        4
unique        4   4        4
top     shristi  12  Newyork
freq          1   1        1

In [260]:
#i want to change the age of shristi, then
df['age'][0]=23

In [261]:
df #shristi's age changed

      name age     city
0  shristi  23  Newyork
1   ankita  15   Berlin
2   binita  20   Sydney
3  prerana  25   Ottawa

In [262]:
#new_row_dict = {"name":'anushka', "age":'21', "city":'Paris'}   #adding new row by using append()
#df=df.append(new_row_dict, ignore_index=True)

In [263]:
#another method using concat
new_row_dict = {"name":'anushka',
                "age":'21', "city":'Paris'}
new_row_df=pd.DataFrame(new_row_dict,index=[0])
df=pd.concat([df,new_row_df],ignore_index=True)

In [264]:
df

      name age     city
0  shristi  23  Newyork
1   ankita  15   Berlin
2   binita  20   Sydney
3  prerana  25   Ottawa
4  anushka  21    Paris

In [265]:
import pandas as pd    #adding new column i.e Gender by using Series attribute
new_column=pd.Series(['Female','Female','Female','Female','Female'])
df['Gender']= new_column

In [266]:
df

      name age     city  Gender
0  shristi  23  Newyork  Female
1   ankita  15   Berlin  Female
2   binita  20   Sydney  Female
3  prerana  25   Ottawa  Female
4  anushka  21    Paris  Female

In [267]:
df.to_csv('excelsheet.csv')